trade_exp/src/Documents/РемонтИТехническоеОбслуживание/РемонтИТехническоеОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3f977b6-26c5-4a49-a553-f515d1d938bf">
  <name>РемонтИТехническоеОбслуживание</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fe55ec5f-01e7-4cbc-b96a-2d43d50fb479">
    <name>Техника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a86b6151-f908-4ff1-833c-751e9e736fb1">
    <name>ДатаВыходаИзСтроя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="21346543-7540-45d4-936e-069b94004c88">
    <name>ДатаВведенияВРаботу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4238f219-b52a-4801-9984-78f3f64fb003">
    <name>ПоказанияПробега</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="60a911e2-f419-414e-bdbf-89c651176987">
    <name>ВидРаботИТехническогоОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b2deed09-12ec-4248-8cdb-281bd3f1af27">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f67fbfc-9a3d-47f1-affe-f4e1fcf20c99">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="74a98c6a-b7dd-4c58-b04d-ba2a74546cb6">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/InformationRegisters/ПараметрыТехники/ПараметрыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e1dd7a41-8f89-4890-bfd0-3f99b5f7c06d">
  <name>ПараметрыТехники</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="aae31d69-157f-4cf9-8b51-60cf483b7a9a">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="3ee3c362-de50-494d-aace-930c27fada78">
    <name>ПоказанияПробега</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7e3244d1-3d89-4bce-b99b-9906731085c2">
    <name>Пробег</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>8</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="f09688b6-ceb3-4e4b-bbb8-294e4f1fc8c9">
    <name>ДатаСледующегоТО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="043084e9-c0f4-4ce7-a2df-13be07c1413e">
    <name>ДатаСледующейЗаменыШин</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="2c7bf3e4-e2ea-4723-8afe-dc48ece9a3e2">
    <name>Техника</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="5700ed32-4290-48f3-b912-d3a2fcd39744">
    <name>ВидРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/РемонтИТехническоеОбслуживание/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

//	ДатаВыходаИзСтроя = ТекущаяДата();
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Техника.ВидНоменклатуры.Наименование = "Оборудование" Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Структура = РассчитатьДатуСледующегоТО(Техника, ВидРаботИТехническогоОбслуживания.ТипРемонта, ПоказанияПробега);
	Если Структура = Null Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПараметрыТехники.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = ДатаВыходаИзСтроя + (Дата - НачалоДня(Дата));
	НоваяЗапись.Техника = Техника;
	НоваяЗапись.ВидРабот = ВидРаботИТехническогоОбслуживания;
	НоваяЗапись.Завершен = Завершен;
	НоваяЗапись.ПоказанияПробега = ПоказанияПробега;

	НоваяЗапись.ДатаСледующегоТО = Структура.ДатаСледующегоТО;
	НоваяЗапись.ДатаСледующейЗаменыШин = Структура.ДатаСледующейЗаменыШин;
	НоваяЗапись.Пробег = Структура.Пробег;
	
	НаборЗаписей.Записать();

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция РассчитатьДатуСледующегоТО(Техника, ТипРемонта, ПоказанияПрбега)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Техника
	|ПОМЕСТИТЬ ВТ_Техника
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Техника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыТехники.Период КАК Период,
	|	ПараметрыТехники.Техника КАК Техника,
	|	МИНИМУМ(ПараметрыТехники.ПоказанияПробега) КАК ПоказанияПробега
	|ПОМЕСТИТЬ ВТ_НачалоПериода
	|ИЗ
	|	РегистрСведений.ПараметрыТехники КАК ПараметрыТехники
	|ГДЕ
	|	ПараметрыТехники.Техника = &Техника
	|	И ПараметрыТехники.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|СГРУППИРОВАТЬ ПО
	|	ПараметрыТехники.Период,
	|	ПараметрыТехники.Техника
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоказанияПробега
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыТехникиСрезПоследних.Период КАК Период,
	|	ПараметрыТехникиСрезПоследних.Техника КАК Техника,
	|	ПараметрыТехникиСрезПоследних.ПоказанияПробега КАК ПоказанияПробега,
	|	ПараметрыТехникиСрезПоследних.Пробег КАК Пробег
	|ПОМЕСТИТЬ ВТ_КонецПериода
	|ИЗ
	|	РегистрСведений.ПараметрыТехники.СрезПоследних(&КонецПериода, Техника = &Техника) КАК ПараметрыТехникиСрезПоследних
	|СГРУППИРОВАТЬ ПО
	|	ПараметрыТехникиСрезПоследних.Техника,
	|	ПараметрыТехникиСрезПоследних.Период,
	|	ПараметрыТехникиСрезПоследних.Пробег,
	|	ПараметрыТехникиСрезПоследних.ПоказанияПробега
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПараметрыТехникиСрезПоследних.ПоказанияПробега УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Техника.Техника КАК Техника,
	|	ВЫБОР
	|		КОГДА &ТекущиеПоказанияПробега < ЕСТЬNULL(ВТ_КонецПериода.ПоказанияПробега, 0)
	|			ТОГДА ЕСТЬNULL(ВТ_КонецПериода.Пробег, 0) + &ТекущиеПоказанияПробега
	|		ИНАЧЕ ЕСТЬNULL(ВТ_КонецПериода.Пробег, 0) + &ТекущиеПоказанияПробега - ЕСТЬNULL(ВТ_КонецПериода.ПоказанияПробега, 0)
	|	КОНЕЦ КАК ТекущийПробег,
	|	ЕСТЬNULL(ВТ_КонецПериода.ПоказанияПробега - ВТ_НачалоПериода.ПоказанияПробега, 0) / ВЫБОР
	|		КОГДА ЕСТЬNULL(РАЗНОСТЬДАТ(ВТ_НачалоПериода.Период, ВТ_КонецПериода.Период, ДЕНЬ), 1) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(ВТ_НачалоПериода.Период, ВТ_КонецПериода.Период, ДЕНЬ), 1)
	|	КОНЕЦ КАК СреднийПробегВДень,
	|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, 0) КАК ИнтервалТО,
	|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты1.Значение, 0) КАК ИнтервалЗаменыШин,
	|	ПараметрыТехникиСрезПоследних.Период КАК ДатаПоследнегоТО,
	|	ПараметрыТехникиСрезПоследних1.Период КАК ДатаПоследнейЗаменыШин,
	|	ЕСТЬNULL(ПараметрыТехникиСрезПоследних.Пробег, 0) КАК ПробегПоследнегоТО,
	|	ЕСТЬNULL(ПараметрыТехникиСрезПоследних1.Пробег, 0) КАК ПробегПоследнейЗаменыШин
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_Техника КАК ВТ_Техника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыТехники.СрезПоследних(&КонецПериода,
	|			ВидРабот.типРемонта = ЗНАЧЕНИЕ(Перечисление.ТипыРемонтов.ТО)) КАК ПараметрыТехникиСрезПоследних
	|		ПО ВТ_Техника.Техника = ПараметрыТехникиСрезПоследних.Техника
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыТехники.СрезПоследних(&КонецПериода,
	|			ВидРабот.типРемонта = ЗНАЧЕНИЕ(Перечисление.ТипыРемонтов.ЗаменаШин)) КАК ПараметрыТехникиСрезПоследних1
	|		ПО ВТ_Техника.Техника = ПараметрыТехникиСрезПоследних1.Техника
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НачалоПериода КАК ВТ_НачалоПериода
	|		ПО ВТ_Техника.Техника = ВТ_НачалоПериода.Техника
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонецПериода КАК ВТ_КонецПериода
	|		ПО ВТ_Техника.Техника = ВТ_КонецПериода.Техника
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ВТ_Техника.Техника = НоменклатураДополнительныеРеквизиты.Ссылка
	|		И (НоменклатураДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул = ""ИнтервалТО"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты1
	|		ПО ВТ_Техника.Техника = НоменклатураДополнительныеРеквизиты1.Ссылка
	|		И (НоменклатураДополнительныеРеквизиты1.Свойство.ИдентификаторДляФормул = ""ИнтервалЗаменыШин"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоследнегоТО УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Техника КАК Техника,
	|	ВТ_Итог.ТекущийПробег КАК ТекущийПробег,
	|	ВТ_Итог.ИнтервалТО КАК ИнтервалТО,
	|	ВТ_Итог.ДатаПоследнегоТО КАК ДатаПоследнегоТО,
	|	ВЫБОР
	|		КОГДА &ТипРемонта = ЗНАЧЕНИЕ(Перечисление.ТипыРемонтов.ТО)
	|			ТОГДА (ВЫРАЗИТЬ(ВТ_Итог.ИнтервалТО КАК ЧИСЛО)) / ВЫБОР
	|				КОГДА ВТ_Итог.СреднийПробегВДень = 0
	|					ТОГДА 1
	|				ИНАЧЕ ВТ_Итог.СреднийПробегВДень
	|			КОНЕЦ
	|		КОГДА ЕСТЬNULL(ВТ_Итог.ДатаПоследнегоТО, 0) = 0
	|		И ВТ_Итог.ТекущийПробег >= ВТ_Итог.ИнтервалТО
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВТ_Итог.ДатаПоследнегоТО, 0) = 0
	|		И ВТ_Итог.ТекущийПробег < ВТ_Итог.ИнтервалТО
	|			ТОГДА ((ВЫРАЗИТЬ(ВТ_Итог.ИнтервалТО КАК ЧИСЛО)) - ВТ_Итог.ТекущийПробег) / ВЫБОР
	|				КОГДА ВТ_Итог.СреднийПробегВДень = 0
	|					ТОГДА 1
	|				ИНАЧЕ ВТ_Итог.СреднийПробегВДень
	|			КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL((ВЫРАЗИТЬ(ВТ_Итог.ИнтервалТО КАК ЧИСЛО)) - (ВТ_Итог.ТекущийПробег -
	|			ЕСТЬNULL(ВТ_Итог.ПробегПоследнегоТО, 0)), 0) / ВЫБОР
	|			КОГДА ВТ_Итог.СреднийПробегВДень = 0
	|				ТОГДА 1
	|			ИНАЧЕ ВТ_Итог.СреднийПробегВДень
	|		КОНЕЦ
	|	КОНЕЦ КАК ДнейДоТО,
	|	ВТ_Итог.ИнтервалЗаменыШин КАК ИнтервалЗаменыШин,
	|	ВТ_Итог.ДатаПоследнейЗаменыШин КАК ДатаПоследнейЗаменыШин,
	|	ВЫБОР
	|		КОГДА &ТипРемонта = ЗНАЧЕНИЕ(Перечисление.ТипыРемонтов.ЗаменаШин)
	|			ТОГДА (ВЫРАЗИТЬ(ВТ_Итог.ИнтервалЗаменыШин КАК ЧИСЛО)) / ВЫБОР
	|				КОГДА ВТ_Итог.СреднийПробегВДень = 0
	|					ТОГДА 1
	|				ИНАЧЕ ВТ_Итог.СреднийПробегВДень
	|			КОНЕЦ
	|		КОГДА ЕСТЬNULL(ВТ_Итог.ДатаПоследнейЗаменыШин, 0) = 0
	|		И ВТ_Итог.ТекущийПробег >= ВТ_Итог.ИнтервалЗаменыШин
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВТ_Итог.ДатаПоследнейЗаменыШин, 0) = 0
	|		И ВТ_Итог.ТекущийПробег < ВТ_Итог.ИнтервалЗаменыШин
	|			ТОГДА ((ВЫРАЗИТЬ(ВТ_Итог.ИнтервалЗаменыШин КАК ЧИСЛО)) - ВТ_Итог.ТекущийПробег) / ВЫБОР
	|				КОГДА ВТ_Итог.СреднийПробегВДень = 0
	|					ТОГДА 1
	|				ИНАЧЕ ВТ_Итог.СреднийПробегВДень
	|			КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL((ВЫРАЗИТЬ(ВТ_Итог.ИнтервалЗаменыШин КАК ЧИСЛО)) - (ВТ_Итог.ТекущийПробег -
	|			ЕСТЬNULL(ВТ_Итог.ПробегПоследнейЗаменыШин, 0)), 0) / ВЫБОР
	|			КОГДА ВТ_Итог.СреднийПробегВДень = 0
	|				ТОГДА 1
	|			ИНАЧЕ ВТ_Итог.СреднийПробегВДень
	|		КОНЕЦ
	|	КОНЕЦ КАК ДнейДоЗаменыШин
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог";

	Запрос.УстановитьПараметр("КонецПериода", ДатаВыходаИзСтроя);
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоДня(Дата), -12));
	Запрос.УстановитьПараметр("Техника", Техника);
	Запрос.УстановитьПараметр("ТекущиеПоказанияПробега", ПоказанияПрбега );
	Запрос.УстановитьПараметр("ТипРемонта", ТипРемонта );
	
	Выборка = Запрос.Выполнить().Выбрать();

	Структура = Новый структура;

	Если Выборка.Следующий() Тогда
		
		ТехникаНаименование = Строка(Техника);

		Если Выборка.ИнтервалТО = 0 Тогда
			Сообщить("Заполните ИнтервалТО для " + ТехникаНаименование + " в карточке номенклатуры");
			Возврат Null;
		КонецЕсли;

		Если Выборка.ИнтервалЗаменыШин = 0 Тогда
			Сообщить("Заполните ИнтервалЗаменыШин для " + ТехникаНаименование + " в карточке номенклатуры");
			Возврат Null;
		КонецЕсли;

		Структура.Вставить("ДатаСледующегоТО", ДатаВыходаИзСтроя + Выборка.ДнейДоТО * 24 * 60 * 60);
		Структура.Вставить("ДатаСледующейЗаменыШин", ДатаВыходаИзСтроя + Выборка.ДнейДоЗаменыШин * 24 * 60 * 60);
		Структура.Вставить("Пробег", Выборка.ТекущийПробег);

	КонецЕсли;

	Возврат Структура;

КонецФункции

#КонецЕсли
